#+TITLE: Ashfaq Farooqui's Emacs Configuration
#+AUTHOR: Ashfaq Farooqui
#+EMAIL: ashfaq.farooqui@gmail.com
#+OPTIONS: toc:3 num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />

** hydra ibuf
#+BEGIN_SRC emacs-lisp
  (defhydra hydra-ibuffer-main (:color pink :hint nil)
    "
   ^Navigation^ | ^Mark^        | ^Actions^        | ^View^
  -^----------^-+-^----^--------+-^-------^--------+-^----^-------
    _k_:    ʌ   | _m_: mark     | _D_: delete      | _g_: refresh
   _RET_: visit | _u_: unmark   | _S_: save        | _s_: sort
    _j_:    v   | _*_: specific | _a_: all actions | _/_: filter
  -^----------^-+-^----^--------+-^-------^--------+-^----^-------
  "
    ("j" ibuffer-forward-line)
    ("RET" ibuffer-visit-buffer :color blue)
    ("k" ibuffer-backward-line)

    ("m" ibuffer-mark-forward)
    ("u" ibuffer-unmark-forward)
    ("*" hydra-ibuffer-mark/body :color blue)

    ("D" ibuffer-do-delete)
    ("S" ibuffer-do-save)
    ("a" hydra-ibuffer-action/body :color blue)

    ("g" ibuffer-update)
    ("s" hydra-ibuffer-sort/body :color blue)
    ("/" hydra-ibuffer-filter/body :color blue)

    ("o" ibuffer-visit-buffer-other-window "other window" :color blue)
    ("q" quit-window "quit ibuffer" :color blue)
    ("." nil "toggle hydra" :color blue))

  (defhydra hydra-ibuffer-mark (:color teal :columns 5
                                :after-exit (hydra-ibuffer-main/body))
    "Mark"
    ("*" ibuffer-unmark-all "unmark all")
    ("M" ibuffer-mark-by-mode "mode")
    ("m" ibuffer-mark-modified-buffers "modified")
    ("u" ibuffer-mark-unsaved-buffers "unsaved")
    ("s" ibuffer-mark-special-buffers "special")
    ("r" ibuffer-mark-read-only-buffers "read-only")
    ("/" ibuffer-mark-dired-buffers "dired")
    ("e" ibuffer-mark-dissociated-buffers "dissociated")
    ("h" ibuffer-mark-help-buffers "help")
    ("z" ibuffer-mark-compressed-file-buffers "compressed")
    ("b" hydra-ibuffer-main/body "back" :color blue))

  (defhydra hydra-ibuffer-action (:color teal :columns 4
                                  :after-exit
                                  (if (eq major-mode 'ibuffer-mode)
                                      (hydra-ibuffer-main/body)))
    "Action"
    ("A" ibuffer-do-view "view")
    ("E" ibuffer-do-eval "eval")
    ("F" ibuffer-do-shell-command-file "shell-command-file")
    ("I" ibuffer-do-query-replace-regexp "query-replace-regexp")
    ("H" ibuffer-do-view-other-frame "view-other-frame")
    ("N" ibuffer-do-shell-command-pipe-replace "shell-cmd-pipe-replace")
    ("M" ibuffer-do-toggle-modified "toggle-modified")
    ("O" ibuffer-do-occur "occur")
    ("P" ibuffer-do-print "print")
    ("Q" ibuffer-do-query-replace "query-replace")
    ("R" ibuffer-do-rename-uniquely "rename-uniquely")
    ("T" ibuffer-do-toggle-read-only "toggle-read-only")
    ("U" ibuffer-do-replace-regexp "replace-regexp")
    ("V" ibuffer-do-revert "revert")
    ("W" ibuffer-do-view-and-eval "view-and-eval")
    ("X" ibuffer-do-shell-command-pipe "shell-command-pipe")
    ("b" nil "back"))

  (defhydra hydra-ibuffer-sort (:color amaranth :columns 3)
    "Sort"
    ("i" ibuffer-invert-sorting "invert")
    ("a" ibuffer-do-sort-by-alphabetic "alphabetic")
    ("v" ibuffer-do-sort-by-recency "recently used")
    ("s" ibuffer-do-sort-by-size "size")
    ("f" ibuffer-do-sort-by-filename/process "filename")
    ("m" ibuffer-do-sort-by-major-mode "mode")
    ("b" hydra-ibuffer-main/body "back" :color blue))

  (defhydra hydra-ibuffer-filter (:color amaranth :columns 4)
    "Filter"
    ("m" ibuffer-filter-by-used-mode "mode")
    ("M" ibuffer-filter-by-derived-mode "derived mode")
    ("n" ibuffer-filter-by-name "name")
    ("c" ibuffer-filter-by-content "content")
    ("e" ibuffer-filter-by-predicate "predicate")
    ("f" ibuffer-filter-by-filename "filename")
    (">" ibuffer-filter-by-size-gt "size")
    ("<" ibuffer-filter-by-size-lt "size")
    ("/" ibuffer-filter-disable "disable")
    ("b" hydra-ibuffer-main/body "back" :color blue))


  (define-key ibuffer-mode-map "." 'hydra-ibuffer-main/body)
(add-hook 'ibuffer-hook #'hydra-ibuffer-main/body)
#+END_SRC

#+RESULTS:
| hydra-ibuffer-main/body |

** modules
#+BEGIN_SRC emacs-lisp
; Enable habit tracking (and a bunch of other modules)
(add-to-list 'org-modules 'org-habit t)
; position the habit graph on the agenda to the right of the default
(setq org-habit-graph-column 50)

(require 'org-tempo)
#+END_SRC

#+RESULTS:
: 50

** org-babel
=org-babel= is a feature inside of =org-mode= that makes this
document possible. It allows for embedding languages inside of an
=org-mode= document with all the proper font-locking. It also
allows you to extract and execute code. I can not ignore headlines when exporting with the :ignore: tag.
#+begin_src emacs-lisp
(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))


  (use-package ob-async
    :ensure t)
  (require 'ox-latex)

  (setq org-latex-create-formula-image-program 'dvipng)
  (require 'ob)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((shell . t)
     (dot . t)
     (latex . t)
     (ledger .t)
     (python . t)
     ))

  (add-to-list 'org-src-lang-modes (quote ("dot". graphviz-dot)))

  (setq org-src-fontify-natively t
        org-confirm-babel-evaluate nil)

  (add-hook 'org-babel-after-execute-hook (lambda ()
                                            (condition-case nil
                                                (org-display-inline-images)
                                              (error nil)))
            'append)

  (add-to-list 'org-latex-packages-alist
               '("" "tikz" t))

  (eval-after-load "preview"
    '(add-to-list 'preview-default-preamble "\\PreviewEnvironment{tikzpicture}" t))
#+end_src

#+RESULTS:
: (\RequirePackage[ (, . preview-default-option-list) ]{preview}[2004/11/05] \PreviewEnvironment{tikzpicture})
** Syntex with evince
#+BEGIN_SRC emacs-lisp
(require 'dbus)
(defun un-urlify (fname-or-url)
  "A trivial function that replaces a prefix of file:/// with just /."
  (if (string= (substring fname-or-url 0 8) "file:///")
     (substring fname-or-url 7)
    fname-or-url))
(defun th-evince-sync (file linecol &rest ignored)
  (let* ((fname (un-urlify file))
         (buf (find-buffer-visiting fname))
         (line (car linecol))
         (col (cadr linecol)))
    (if (null buf)
        (message "[Synctex]: %s is not opened..." fname)
      (switch-to-buffer buf)
      (goto-line (car linecol))
      (unless (= col -1)
        (move-to-column col)))))
(defvar *dbus-evince-signal* nil)
(defun enable-evince-sync ()
  (require 'dbus)
  (when (and
         (eq window-system 'x)
         (fboundp 'dbus-register-signal))
    (unless *dbus-evince-signal*
      (setf *dbus-evince-signal*
            (dbus-register-signal
             :session nil "/org/gnome/evince/Window/0"
             "org.gnome.evince.Window" "SyncSource"
             'th-evince-sync)))))
(add-hook 'LaTeX-mode-hook 'enable-evince-sync)
#+END_SRC
#+RESULTS:
| enable-evince-sync | visual-line-mode | pdf-tools-install | (lambda nil (rainbow-delimiters-mode) (company-mode) (smartparens-mode) (turn-on-reftex) (setq reftex-plug-into-AUCTeX t) (reftex-isearch-minor-mode) (flyspell-mode) (visual-line-mode) (setq TeX-PDF-mode t) (setq TeX-source-correlate-method (quote synctex)) (setq TeX-source-correlate-start-server t)) | (lambda nil (flyspell-mode)) | (lambda nil (writegood-mode)) | dubcaps-mode |
* Theme
#+BEGIN_SRC emacs-lisp

           ;;(use-package zerodark-theme2
           ;;  :ensure t
           ;;  :config
           ;;  (load-theme 'zerodark t)
             ;;      (zerodark-setup-modeline-format)
           ;;  )


           (use-package doom-themes
             :ensure t)

           ;; Global settings (defaults)
           (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
                 doom-themes-enable-italic t) ; if nil, italics is universally disabled

           ;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
           ;; may have their own settings.
           (load-theme 'doom-one t)

           ;; Enable flashing mode-line on errors
           (doom-themes-visual-bell-config)

           ;; Enable custom neotree theme (all-the-icons must be installed!)
           (doom-themes-neotree-config)
           ;; or for treemacs users
           (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
           (doom-themes-treemacs-config)

           ;; Corrects (and improves) org-mode's native fontification.
           (doom-themes-org-config)


           ;;;If you use nlinum or linum in org-mode, the larger headline sizes in some themes could bleed into the line numbers.

           ;;; Fix this by setting :height explicitly for your line number plugins, after you've loaded the theme. e.g.
          ;; (let ((height (face-attribute 'default :height)))
             ;; for all linum/nlinum users
          ;;   (set-face-attribute 'linum nil :height height)
             ;; only for `linum-relative' users:
          ;;   (set-face-attribute 'linum-relative-current-face nil :height height)
          ;;  )

           ;;modeline

             (use-package doom-modeline
                   :ensure t
                   :hook (after-init . doom-modeline-mode))
             (use-package nyan-mode
               :ensure t
               :config
               (nyan-mode))



           ;;; doommodeline config
           (setq doom-modeline-buffer-file-name-style 'truncate-upto-project)

           ;; Whether display icons in mode-line or not.
           (setq doom-modeline-icon (display-graphic-p))

           ;; Whether display the icon for major mode. It respects `doom-modeline-icon'.
           (setq doom-modeline-major-mode-icon t)

           ;; Whether display color icons for `major-mode'. It respects
           ;; `doom-modeline-icon' and `all-the-icons-color-icons'.
           (setq doom-modeline-major-mode-color-icon t)

           ;; Whether display icons for buffer states. It respects `doom-modeline-icon'.
           (setq doom-modeline-buffer-state-icon t)

           ;; Whether display buffer modification icon. It respects `doom-modeline-icon'
           ;; and `doom-modeline-buffer-state-icon'.
           (setq doom-modeline-buffer-modification-icon t)

           ;; Whether display minor modes in mode-line or not.
           (setq doom-modeline-minor-modes (featurep 'minions))

           ;; If non-nil, a word count will be added to the selection-info modeline segment.
           (setq doom-modeline-enable-word-count nil)

           ;; Whether display buffer encoding.
           (setq doom-modeline-buffer-encoding t)

           ;; Whether display indentation information.
           (setq doom-modeline-indent-info nil)

           ;; If non-nil, only display one number for checker information if applicable.
           (setq doom-modeline-checker-simple-format t)

           ;; The maximum displayed length of the branch name of version control.
           (setq doom-modeline-vcs-max-length 12)

           ;; Whether display perspective name or not. Non-nil to display in mode-line.
           (setq doom-modeline-persp-name t)

           ;; Whether display icon for persp name. Nil to display a # sign. It respects `doom-modeline-icon'
           (setq doom-modeline-persp-name-icon nil)

           ;; Whether display `lsp' state or not. Non-nil to display in mode-line.
           (setq doom-modeline-lsp t)

           ;; Whether display GitHub notifications or not. Requires `ghub` package.
           (setq doom-modeline-github nil)

           ;; The interval of checking GitHub.
           (setq doom-modeline-github-interval (* 30 60))

           ;; Whether display mu4e notifications or not. Requires `mu4e-alert' package.
           (setq doom-modeline-mu4e t)

           ;; Whether display irc notifications or not. Requires `circe' package.
           (setq doom-modeline-irc t)

           ;; Function to stylize the irc buffer names.
           (setq doom-modeline-irc-stylize 'identity)

           ;; Whether display environment version or not
           (setq doom-modeline-env-version t)
           ;; Or for individual languages
           (setq doom-modeline-env-enable-python t)
           (setq doom-modeline-env-enable-ruby t)
           (setq doom-modeline-env-enable-perl t)
           (setq doom-modeline-env-enable-go t)
           (setq doom-modeline-env-enable-elixir t)
           (setq doom-modeline-env-enable-rust t)

           ;; Change the executables to use for the language version string
           (setq doom-modeline-env-python-executable "python") ; or `python-shell-interpreter'
           (setq doom-modeline-env-ruby-executable "ruby")
           (setq doom-modeline-env-perl-executable "perl")
           (setq doom-modeline-env-go-executable "go")
           (setq doom-modeline-env-elixir-executable "iex")
           (setq doom-modeline-env-rust-executable "rustc")

           ;; What to dispaly as the version while a new one is being loaded
           (setq doom-modeline-env-load-string "...")

           ;; Hooks that run before/after the modeline version string is updated
           (setq doom-modeline-before-update-env-hook nil)
           (setq doom-modeline-after-update-env-hook nil)

          (setq pdf-view-midnight-colors '("#bbc2cf" . "#282c34"))
          ;; midnite mode hook
        ;;This should be in pdftools
         (add-hook 'pdf-view-mode-hook (lambda ()
                                         (pdf-view-midnight-minor-mode))) ; automatically turns on midnight-mode for pdfs





           ;;;;Some config to make deamon work with i3
      (if (daemonp)
          (add-hook 'after-make-frame-functions
                    (lambda (frame)
                      (with-selected-frame frame
                        (load-theme 'doom-one t)
                      (setq doom-modeline-icons (display-graphic-p)))
                      ))
        (load-theme 'doom-one t))
#+END_SRC

#+RESULTS:
| t | eyebrowse-init | x-dnd-init-frame | (lambda (frame) (with-selected-frame frame (load-theme (quote doom-one) t))) |

